stressTest/art-test.yaml
# single song request
# config:
#   target: "http://localhost:8000"
#   phases:
#     - duration: 60
#       arrivalRate: 200
# scenarios:
#   - flow:
#       - get:
#           url: "/songDescription/1000002

# loop thru song requests
# In this example each virtual user will make 100 requests, 1 to each song


config:
  target: "http://localhost:8000"
  phases:
    - duration: 15
      arrivalRate: 2
      # over 15 seconds, 2 virtual user will make 100 requests per second each
      # equaling 3000 total requests in 15 seconds
  variables:
    productIds:
      - [ 300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311,
        312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323,
        324, 325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335,
        336, 337, 338, 339, 340, 341, 342, 343, 344, 345, 346, 347,
        348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359,
        360, 361, 362, 363, 364, 365, 366, 367, 368, 369, 370, 371,
        372, 373, 374, 375, 376, 377, 378, 379, 380, 381, 382, 383,
        384, 385, 386, 387, 388, 389, 390, 391, 392, 393, 394, 395,
        396, 397, 398, 399]
scenarios:
  - flow:
      - loop:
          - get:
              url: "/songDescription/{{ $loopElement }}"
        over: productIds